[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:31:9
     Id = transit.Id;
     _distance = transit.Km;
     Factor = transit.Factor;
-    if (transit.Price != null)
+    if (transit.Price == null)
     {
       Price = new decimal(transit.Price.Value);
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Block removal mutation
src/Cabs/Dto/TransitDto.cs:32:5
     _distance = transit.Km;
     Factor = transit.Factor;
     if (transit.Price != null)
-    {
-      Price = new decimal(transit.Price.Value);
-    }
+    {}
 
     _date = transit.DateTime;
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Killed] Statement mutation
src/Cabs/Dto/TransitDto.cs:38:5
 
     _date = transit.DateTime;
     Status = transit.Status;
-    SetTariff(transit);
+    ;
     foreach (var d in transit.ProposedDrivers) 
     {
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Survived] Statement mutation
src/Cabs/Dto/TransitDto.cs:41:7
     SetTariff(transit);
     foreach (var d in transit.ProposedDrivers) 
     {
-      ProposedDrivers.Add(new DriverDto(d));
+      ;
     }
     To = new AddressDto(transit.To);

[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:47:9
     From = new AddressDto(transit.From);
     CarClass = transit.CarType;
     ClientDto = new ClientDto(transit.Client);
-    if (transit.DriversFee != null)
+    if (transit.DriversFee == null)
     {
       DriverFee = new decimal(transit.DriversFee.Value);
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Block removal mutation
src/Cabs/Dto/TransitDto.cs:48:5
     CarClass = transit.CarType;
     ClientDto = new ClientDto(transit.Client);
     if (transit.DriversFee != null)
-    {
-      DriverFee = new decimal(transit.DriversFee.Value);
-    }
+    {}
 
     if (transit.EstimatedPrice != null)
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:52:9
       DriverFee = new decimal(transit.DriversFee.Value);
     }
 
-    if (transit.EstimatedPrice != null)
+    if (transit.EstimatedPrice == null)
     {
       EstimatedPrice = new decimal(transit.EstimatedPrice.Value);
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Block removal mutation
src/Cabs/Dto/TransitDto.cs:53:5
     }
 
     if (transit.EstimatedPrice != null)
-    {
-      EstimatedPrice = new decimal(transit.EstimatedPrice.Value);
-    }
+    {}
 
     DateTime = transit.DateTime;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Negate expression
src/Cabs/Dto/TransitDto.cs:72:9
     var day = _date.Value.InZone( DateTimeZoneProviders.Bcl.GetSystemDefault()).LocalDateTime;
 
     // wprowadzenie nowych cennikow od 1.01.2019
-    if (day.Year <= 2018)
+    if (!(day.Year <= 2018))
     {
       KmRate = 1.0f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:72:9
     var day = _date.Value.InZone( DateTimeZoneProviders.Bcl.GetSystemDefault()).LocalDateTime;
 
     // wprowadzenie nowych cennikow od 1.01.2019
-    if (day.Year <= 2018)
+    if (day.Year > 2018)
     {
       KmRate = 1.0f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[NoCoverage] Statement mutation
src/Cabs/Dto/TransitDto.cs:76:7
     {
       KmRate = 1.0f;
       Tariff = "Standard";
-      return;
+      ;
     }
 

[Survived] Logical mutation
src/Cabs/Dto/TransitDto.cs:80:16
     }
 
     var year = day.Year;
-    var leap = ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
+    var leap = ((year % 4 == 0) && (year % 100 != 0)) && (year % 400 == 0);
 
     if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||

[Survived] Arithmetic mutation
src/Cabs/Dto/TransitDto.cs:80:18
     }
 
     var year = day.Year;
-    var leap = ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
+    var leap = ((year * 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
 
     if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||

[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:82:54
     var year = day.Year;
     var leap = ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
 
-    if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||
+    if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear != 365)) ||
         (day.DayOfYear == 1 && day.Hour <= 6))
     {
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Killed] Negate expression
src/Cabs/Dto/TransitDto.cs:82:9
     var year = day.Year;
     var leap = ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
 
-    if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||
-        (day.DayOfYear == 1 && day.Hour <= 6))
+    if (!(((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||
+        (day.DayOfYear == 1 && day.Hour <= 6)))
     {
       Tariff = "Sylwester";
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[NoCoverage] Equality mutation
src/Cabs/Dto/TransitDto.cs:83:32
     var leap = ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
 
     if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||
-        (day.DayOfYear == 1 && day.Hour <= 6))
+        (day.DayOfYear == 1 && day.Hour > 6))
     {
       Tariff = "Sylwester";

[Survived] Equality mutation
src/Cabs/Dto/TransitDto.cs:83:10
     var leap = ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
 
     if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||
-        (day.DayOfYear == 1 && day.Hour <= 6))
+        (day.DayOfYear != 1 && day.Hour <= 6))
     {
       Tariff = "Sylwester";

[NoCoverage] String mutation
src/Cabs/Dto/TransitDto.cs:85:16
     if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||
         (day.DayOfYear == 1 && day.Hour <= 6))
     {
-      Tariff = "Sylwester";
+      Tariff = "";
       KmRate = 3.50f;
     }

[Killed] Negate expression
src/Cabs/Dto/TransitDto.cs:100:15
           Tariff = "Standard";
           break;
         case IsoDayOfWeek.Friday:
-          if (day.Hour < 17)
+          if (!(day.Hour < 17))
           {
             Tariff = "Standard";
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:100:15
           Tariff = "Standard";
           break;
         case IsoDayOfWeek.Friday:
-          if (day.Hour < 17)
+          if (day.Hour > 17)
           {
             Tariff = "Standard";
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Survived] Equality mutation
src/Cabs/Dto/TransitDto.cs:113:31
 
           break;
         case IsoDayOfWeek.Saturday:
-          if (day.Hour < 6 || day.Hour >= 17)
+          if (day.Hour < 6 || day.Hour > 17)
           {
             KmRate = 2.50f;

[Survived] Equality mutation
src/Cabs/Dto/TransitDto.cs:113:15
 
           break;
         case IsoDayOfWeek.Saturday:
-          if (day.Hour < 6 || day.Hour >= 17)
+          if (day.Hour <= 6 || day.Hour >= 17)
           {
             KmRate = 2.50f;

[Survived] Equality mutation
src/Cabs/Dto/TransitDto.cs:118:20
             KmRate = 2.50f;
             Tariff = "Weekend+";
           }
-          else if (day.Hour < 17)
+          else if (day.Hour <= 17)
           {
             KmRate = 1.5f;

[Survived] Negate expression
src/Cabs/Dto/TransitDto.cs:118:20
             KmRate = 2.50f;
             Tariff = "Weekend+";
           }
-          else if (day.Hour < 17)
+          else if (!(day.Hour < 17))
           {
             KmRate = 1.5f;

[Survived] String mutation
src/Cabs/Dto/TransitDto.cs:121:22
           else if (day.Hour < 17)
           {
             KmRate = 1.5f;
-            Tariff = "Weekend";
+            Tariff = "";
           }
 

[Survived] Equality mutation
src/Cabs/Dto/TransitDto.cs:126:15
 
           break;
         case IsoDayOfWeek.Sunday:
-          if (day.Hour < 6)
+          if (day.Hour > 6)
           {
             KmRate = 2.50f;

[Survived] Equality mutation
src/Cabs/Dto/TransitDto.cs:126:15
 
           break;
         case IsoDayOfWeek.Sunday:
-          if (day.Hour < 6)
+          if (day.Hour <= 6)
           {
             KmRate = 2.50f;

[NoCoverage] String mutation
src/Cabs/Dto/TransitDto.cs:129:22
           if (day.Hour < 6)
           {
             KmRate = 2.50f;
-            Tariff = "Weekend+";
+            Tariff = "";
           }
           else

[NoCoverage] Equality mutation
src/Cabs/Dto/TransitDto.cs:149:9
   {
     var usCulture = CultureInfo.CreateSpecificCulture("en-US");
     _distanceUnit = unit;
-    if (unit == "km")
+    if (unit != "km")
     {
       if (_distance == Math.Ceiling(_distance))

[NoCoverage] Equality mutation
src/Cabs/Dto/TransitDto.cs:151:11
     _distanceUnit = unit;
     if (unit == "km")
     {
-      if (_distance == Math.Ceiling(_distance))
+      if (_distance != Math.Ceiling(_distance))
       {
         return Math.Round(_distance).ToString(usCulture) + "km";

[NoCoverage] String mutation
src/Cabs/Dto/TransitDto.cs:157:55
 
       }
 
-      return _distance.ToString("0.000", usCulture) + "km";
+      return _distance.ToString("0.000", usCulture) + "";
     }
 

[NoCoverage] Equality mutation
src/Cabs/Dto/TransitDto.cs:160:9
       return _distance.ToString("0.000", usCulture) + "km";
     }
 
-    if (unit == "miles")
+    if (unit != "miles")
     {
       var distance = _distance / 1.609344f;

[NoCoverage] Arithmetic mutation
src/Cabs/Dto/TransitDto.cs:162:22
 
     if (unit == "miles")
     {
-      var distance = _distance / 1.609344f;
+      var distance = _distance * 1.609344f;
       if (distance == Math.Ceiling(distance))
       {

[NoCoverage] Equality mutation
src/Cabs/Dto/TransitDto.cs:163:11
     if (unit == "miles")
     {
       var distance = _distance / 1.609344f;
-      if (distance == Math.Ceiling(distance))
+      if (distance != Math.Ceiling(distance))
       {
         return Math.Round(distance).ToString(usCulture) + "miles";

[NoCoverage] String mutation
src/Cabs/Dto/TransitDto.cs:165:59
       var distance = _distance / 1.609344f;
       if (distance == Math.Ceiling(distance))
       {
-        return Math.Round(distance).ToString(usCulture) + "miles";
+        return Math.Round(distance).ToString(usCulture) + "";
       }
 

[NoCoverage] String mutation
src/Cabs/Dto/TransitDto.cs:168:32
         return Math.Round(distance).ToString(usCulture) + "miles";
       }
 
-      return distance.ToString("0.000", usCulture) + "miles";
+      return distance.ToString("", usCulture) + "miles";
     }
 

[NoCoverage] Equality mutation
src/Cabs/Dto/TransitDto.cs:171:9
       return distance.ToString("0.000", usCulture) + "miles";
     }
 
-    if (unit == "m")
+    if (unit != "m")
     {
       return Math.Round(_distance*1000).ToString(usCulture) + "m";

[NoCoverage] String mutation
src/Cabs/Dto/TransitDto.cs:171:17
       return distance.ToString("0.000", usCulture) + "miles";
     }
 
-    if (unit == "m")
+    if (unit == "")
     {
       return Math.Round(_distance*1000).ToString(usCulture) + "m";

[NoCoverage] Arithmetic mutation
src/Cabs/Dto/TransitDto.cs:173:25
 
     if (unit == "m")
     {
-      return Math.Round(_distance*1000).ToString(usCulture) + "m";
+      return Math.Round(_distance/1000).ToString(usCulture) + "m";
     }
 

[NoCoverage] Statement mutation
src/Cabs/Dto/TransitDto.cs:176:5
       return Math.Round(_distance*1000).ToString(usCulture) + "m";
     }
 
-    throw new ArgumentException("Invalid unit " + unit);
+    ;
   }
 

[NoCoverage] String mutation
src/Cabs/Dto/TransitDto.cs:176:33
       return Math.Round(_distance*1000).ToString(usCulture) + "m";
     }
 
-    throw new ArgumentException("Invalid unit " + unit);
+    throw new ArgumentException("" + unit);
   }
 
