[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:65:9
 
   public int EstimateCost()
   {
-    if (Status == Statuses.Completed)
+    if (Status != Statuses.Completed)
     {
       throw new InvalidOperationException("Estimating cost for completed transit is forbidden, id = " + Id);
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[NoCoverage] Statement mutation
src/Cabs/Entity/Transit.cs:67:7
   {
     if (Status == Statuses.Completed)
     {
-      throw new InvalidOperationException("Estimating cost for completed transit is forbidden, id = " + Id);
+      ;
     }
 

[Killed] Block removal mutation
src/Cabs/Entity/Transit.cs:83:5
   public int CalculateFinalCosts()
   {
     if (Status == Statuses.Completed)
-    {
-      return CalculateCost();
-    }
+    {}
     else
     {
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[NoCoverage] Statement mutation
src/Cabs/Entity/Transit.cs:88:7
     }
     else
     {
-      throw new InvalidOperationException("Cannot calculate final cost if the transit is not completed");
+      ;
     }
   }

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:96:9
   {
     var baseFee = BaseFee;
     var factorToCalculate = Factor;
-    if (factorToCalculate == null)
+    if (factorToCalculate != null)
     {
       factorToCalculate = 1;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Block removal mutation
src/Cabs/Entity/Transit.cs:97:5
     var baseFee = BaseFee;
     var factorToCalculate = Factor;
     if (factorToCalculate == null)
-    {
-      factorToCalculate = 1;
-    }
+    {}
 
     float kmRate;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[NoCoverage] Statement mutation
src/Cabs/Entity/Transit.cs:107:7
     if (day.Year <= 2018)
     {
       kmRate = 1.0f;
-      baseFee++;
+      ;
     }
     else

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
src/Cabs/Entity/Transit.cs:107:7
     if (day.Year <= 2018)
     {
       kmRate = 1.0f;
-      baseFee++;
+      baseFee--;
     }
     else

[Killed] Negate expression
src/Cabs/Entity/Transit.cs:111:11
     }
     else
     {
-      if ((day.Month == 12 && day.Day == 31) ||
-          (day.Month == 1 && day.Day == 1 && day.Hour <= 6))
+      if (!((day.Month == 12 && day.Day == 31) ||
+          (day.Month == 1 && day.Day == 1 && day.Hour <= 6)))
       {
         kmRate = 3.50f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes; LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Survived] Logical mutation
src/Cabs/Entity/Transit.cs:111:12
     }
     else
     {
-      if ((day.Month == 12 && day.Day == 31) ||
+      if ((day.Month == 12 || day.Day == 31) ||
           (day.Month == 1 && day.Day == 1 && day.Hour <= 6))
       {

[Survived] Logical mutation
src/Cabs/Entity/Transit.cs:112:12
     else
     {
       if ((day.Month == 12 && day.Day == 31) ||
-          (day.Month == 1 && day.Day == 1 && day.Hour <= 6))
+          (day.Month == 1 || day.Day == 1 && day.Hour <= 6))
       {
         kmRate = 3.50f;

[Survived] Equality mutation
src/Cabs/Entity/Transit.cs:112:30
     else
     {
       if ((day.Month == 12 && day.Day == 31) ||
-          (day.Month == 1 && day.Day == 1 && day.Hour <= 6))
+          (day.Month == 1 && day.Day != 1 && day.Hour <= 6))
       {
         kmRate = 3.50f;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
src/Cabs/Entity/Transit.cs:115:9
           (day.Month == 1 && day.Day == 1 && day.Hour <= 6))
       {
         kmRate = 3.50f;
-        baseFee += 3;
+        baseFee -= 3;
       }
       else

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:120:54
       else
       {
         // piątek i sobota po 17 do 6 następnego dnia
-        if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
+        if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour < 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Killed] Logical mutation
src/Cabs/Entity/Transit.cs:120:14
       else
       {
         // piątek i sobota po 17 do 6 następnego dnia
-        if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
+        if ((day.DayOfWeek == IsoDayOfWeek.Friday || day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:121:56
       {
         // piątek i sobota po 17 do 6 następnego dnia
         if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
-            (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
+            (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 6) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour <= 6))
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100

[Killed] Logical mutation
src/Cabs/Entity/Transit.cs:121:14
       {
         // piątek i sobota po 17 do 6 następnego dnia
         if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
-            (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
+            (day.DayOfWeek == IsoDayOfWeek.Saturday || day.Hour <= 6) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour <= 6))
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100

[Killed] Logical mutation
src/Cabs/Entity/Transit.cs:122:14
         // piątek i sobota po 17 do 6 następnego dnia
         if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
-            (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
+            (day.DayOfWeek == IsoDayOfWeek.Saturday || day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour <= 6))
         {
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:122:14
         // piątek i sobota po 17 do 6 następnego dnia
         if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
-            (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
+            (day.DayOfWeek != IsoDayOfWeek.Saturday && day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour <= 6))
         {
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:123:54
         if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
-            (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour <= 6))
+            (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour > 6))
         {
           kmRate = 2.50f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Logical mutation
src/Cabs/Entity/Transit.cs:123:14
         if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
-            (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour <= 6))
+            (day.DayOfWeek == IsoDayOfWeek.Sunday || day.Hour <= 6))
         {
           kmRate = 2.50f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
src/Cabs/Entity/Transit.cs:126:11
             (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour <= 6))
         {
           kmRate = 2.50f;
-          baseFee += 2;
+          baseFee -= 2;
         }
         else
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Killed] Negate expression
src/Cabs/Entity/Transit.cs:131:15
         else
         {
           // pozostałe godziny weekendu
-          if ((day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 6 && day.Hour < 17) ||
-              (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour > 6))
+          if (!((day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 6 && day.Hour < 17) ||
+              (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour > 6)))
           {
             kmRate = 1.5f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:131:16
         else
         {
           // pozostałe godziny weekendu
-          if ((day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 6 && day.Hour < 17) ||
+          if ((day.DayOfWeek != IsoDayOfWeek.Saturday && day.Hour > 6 && day.Hour < 17) ||
               (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour > 6))
           {
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:132:16
         {
           // pozostałe godziny weekendu
           if ((day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 6 && day.Hour < 17) ||
-              (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour > 6))
+              (day.DayOfWeek != IsoDayOfWeek.Sunday && day.Hour > 6))
           {
             kmRate = 1.5f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:132:56
         {
           // pozostałe godziny weekendu
           if ((day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 6 && day.Hour < 17) ||
-              (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour > 6))
+              (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour < 6))
           {
             kmRate = 1.5f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Arithmetic mutation
src/Cabs/Entity/Transit.cs:146:36
       }
     }
 
-    var pricedecimal = new decimal(_km * kmRate * factorToCalculate.Value + baseFee);
+    var pricedecimal = new decimal(_km * kmRate * factorToCalculate.Value - baseFee);
     pricedecimal = decimal.Round(pricedecimal, 2, MidpointRounding.ToPositiveInfinity);
     var finalPrice = int.Parse(pricedecimal.ToString("0.00", CultureInfo.InvariantCulture).Replace(".", ""));
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Arithmetic mutation
src/Cabs/Entity/Transit.cs:146:36
       }
     }
 
-    var pricedecimal = new decimal(_km * kmRate * factorToCalculate.Value + baseFee);
+    var pricedecimal = new decimal(_km / kmRate * factorToCalculate.Value + baseFee);
     pricedecimal = decimal.Round(pricedecimal, 2, MidpointRounding.ToPositiveInfinity);
     var finalPrice = int.Parse(pricedecimal.ToString("0.00", CultureInfo.InvariantCulture).Replace(".", ""));
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Killed] Statement mutation
src/Cabs/Entity/Transit.cs:163:7
     set
     {
       _km = value;
-      EstimateCost();
+      ;
     }
   }
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.SaturdayNoonTransitOf42KmCosts7100; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsOneOfFourTariffs; LegacyFighter.CabsTests.Kata.Demo.PriceListCharacterization.TransitOf42KmCostsWhatTheTestItselfComputes

[Survived] Boolean mutation
src/Cabs/Entity/Transit.cs:179:44
 
   public override bool Equals(object obj)
   {
-    if (ReferenceEquals(this, obj)) return true;
+    if (ReferenceEquals(this, obj)) return false;
     return obj != null && Id != null && Id == (obj as Transit)?.Id;
   }

[Survived] Negate expression
src/Cabs/Entity/Transit.cs:179:9
 
   public override bool Equals(object obj)
   {
-    if (ReferenceEquals(this, obj)) return true;
+    if (!(ReferenceEquals(this, obj))) return true;
     return obj != null && Id != null && Id == (obj as Transit)?.Id;
   }

[NoCoverage] Equality mutation
src/Cabs/Entity/Transit.cs:180:27
   public override bool Equals(object obj)
   {
     if (ReferenceEquals(this, obj)) return true;
-    return obj != null && Id != null && Id == (obj as Transit)?.Id;
+    return obj != null && Id == null && Id == (obj as Transit)?.Id;
   }
 

[NoCoverage] Equality mutation
src/Cabs/Entity/Transit.cs:180:12
   public override bool Equals(object obj)
   {
     if (ReferenceEquals(this, obj)) return true;
-    return obj != null && Id != null && Id == (obj as Transit)?.Id;
+    return obj == null && Id != null && Id == (obj as Transit)?.Id;
   }
 

[Survived] Block removal mutation
src/Cabs/Entity/Transit.cs:184:3
   }
 
   public static bool operator ==(Transit left, Transit right)
-  {
-    return Equals(left, right);
-  }
+  {}
 
   public static bool operator !=(Transit left, Transit right)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/Cabs/Entity/Transit.cs:190:12
 
   public static bool operator !=(Transit left, Transit right)
   {
-    return !Equals(left, right);
+    return Equals(left, right);
   }
 
killedBy: LegacyFighter.CabsTests.Kata.Demo.TransitFromOrderToInvoice.FridayEveningTransitOf42KmCosts11500

[Survived] Block removal mutation
src/Cabs/Entity/Transit.cs:194:3
   }
 
   public void CompleteTransitAt(Instant when)
-  {
-    CompleteAt = when;
-  }
+  {}
 
   public int? DriversFee { get; set; }
