[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:72:9
     var day = _date.Value.InZone( DateTimeZoneProviders.Bcl.GetSystemDefault()).LocalDateTime;
 
     // wprowadzenie nowych cennikow od 1.01.2019
-    if (day.Year <= 2018)
+    if (day.Year < 2018)
     {
       KmRate = 1.0f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList

[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:80:18
     }
 
     var year = day.Year;
-    var leap = ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
+    var leap = ((year % 4 != 0) && (year % 100 != 0)) || (year % 400 == 0);
 
     if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList

[Killed] Logical mutation
src/Cabs/Dto/TransitDto.cs:80:17
     }
 
     var year = day.Year;
-    var leap = ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
+    var leap = ((year % 4 == 0) || (year % 100 != 0)) || (year % 400 == 0);
 
     if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList

[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:82:19
     var year = day.Year;
     var leap = ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
 
-    if (((leap && day.DayOfYear == 366) || (!leap && day.DayOfYear == 365)) ||
+    if (((leap && day.DayOfYear != 366) || (!leap && day.DayOfYear == 365)) ||
         (day.DayOfYear == 1 && day.Hour <= 6))
     {
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList

[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:100:15
           Tariff = "Standard";
           break;
         case IsoDayOfWeek.Friday:
-          if (day.Hour < 17)
+          if (day.Hour <= 17)
           {
             Tariff = "Standard";
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList

[Killed] Equality mutation
src/Cabs/Dto/TransitDto.cs:118:20
             KmRate = 2.50f;
             Tariff = "Weekend+";
           }
-          else if (day.Hour < 17)
+          else if (day.Hour > 17)
           {
             KmRate = 1.5f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList
