[Killed] Logical mutation
src/Cabs/Entity/Transit.cs:111:11
     }
     else
     {
-      if ((day.Month == 12 && day.Day == 31) ||
-          (day.Month == 1 && day.Day == 1 && day.Hour <= 6))
+      if ((day.Month == 12 && day.Day == 31) &&
+          (day.Month == 1 && day.Day == 1 && day.Hour <= 6))
       {
         kmRate = 3.50f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:121:56
       {
         // piątek i sobota po 17 do 6 następnego dnia
         if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
-            (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
+            (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour < 6) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour <= 6))
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList

[Killed] Equality mutation
src/Cabs/Entity/Transit.cs:122:56
         // piątek i sobota po 17 do 6 następnego dnia
         if ((day.DayOfWeek == IsoDayOfWeek.Friday && day.Hour >= 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour <= 6) ||
-            (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour >= 17) ||
+            (day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 17) ||
             (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour <= 6))
         {
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList

[Killed] Logical mutation
src/Cabs/Entity/Transit.cs:131:16
         else
         {
           // pozostałe godziny weekendu
-          if ((day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 6 && day.Hour < 17) ||
+          if ((day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 6 || day.Hour < 17) ||
               (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour > 6))
           {
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList

[Killed] Logical mutation
src/Cabs/Entity/Transit.cs:132:16
         {
           // pozostałe godziny weekendu
           if ((day.DayOfWeek == IsoDayOfWeek.Saturday && day.Hour > 6 && day.Hour < 17) ||
-              (day.DayOfWeek == IsoDayOfWeek.Sunday && day.Hour > 6))
+              (day.DayOfWeek == IsoDayOfWeek.Sunday || day.Hour > 6))
           {
             kmRate = 1.5f;
killedBy: LegacyFighter.CabsTests.Kata.Demo.PriceListGoldenMaster.PriceList
